{
    "Carbon Steel": {
        "0-2": "Organic and phosphate corrosion inhibitors are used in highly acid environments. Organic molecules in solution block active sites on the metal surface and form an impermeable barrier from deposited phosphate coatings. In cases involving sulfuric or hydrochloric acid, polymer coatings or linings such as epoxy can be highly effective.",
        "2-4" : "In combination with corrosion inhibitors like zinc phosphate or chromates, corrosion is mitigated with galvanizing, or coating with zinc. Cathodic protection is commonly used to protect against oxidation.",
        "4-6" : "Organic coatings, in combination with chemicals, such as phosphating or protective films, on bitumen-based coatings have proven effective for surface passivation. Low-carbon steels can also be used in such applications since they are less susceptible to acid corrosion.",
        "7" : "Carbon steel corrodes slowly in neutral conditions. It is normally protected by barrier coatings, anodic protection techniques, or protective paints. Furthermore, surface texturing can improve corrosion resistance as it also decreases the area exposed to corrosive substances.",
        "7-9" : "applying protective coatings like epoxy or polymeric coatings is essential, especially in harsh environments. In alkaline conditions, corrosion tends to slow down naturally. However, in certain marine environments, it is important to note that some corrosion inhibitors can weaken the effectiveness of sacrificial anodes made of materials like magnesium or zinc, which are commonly used to reduce corrosion.",
        "9-11" : "Alkaline-resistant coatings, combined with inhibitors like silicates or polyphosphates are effective for corrosion prevention. These inhibitors form stable surface complexes that act as a protective barrier, stopping corrosion before it starts. By applying these coatings and inhibitors, you can ensure long-lasting protection, even in environments where steel is exposed to alkaline conditions.",
        "11-13" : "An effective method for preventing corrosion is to use organic inhibitors like alkanolamines, which create a protective coating on the steel surface. These inhibitors work by blocking active sites on the metal, reducing the rate of corrosion by limiting the surface's exposure to the environment.",
        ">13" : "There are several effective strategies to prevent carbon steel from corroding in high pH environments. One approach is the use of inhibitors like molybdate and phosphates, which form protective coatings in strongly alkaline solutions, slowing down the corrosion process. Surface treatments, such as applying a zinc-rich primer or epoxy/polyurethane coatings, create a physical barrier that shields the steel. Additionally, cathodic protection, an electrochemical technique, is commonly used in highly alkaline conditions to further prevent corrosion.",
        "link_0-2": "https://www.mdpi.com/2075-4701/14/8/862",
        "link_2-4" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_4-6" : "https://www.mdpi.com/2075-4701/14/8/862",
        "link_7" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_7-9" : "https://www.mdpi.com/2075-4701/14/8/862",
        "link_9-11" : "https://www.mdpi.com/2075-4701/14/8/862",
        "link_11-13" : "https://link.springer.com/article/10.1007/s40735-023-00791-4",
        "link_>13" : "https://meridian.allenpress.com/corrosion/article/75/1/106/199221/Long-Term-Evolution-of-Corrosion-Potential-of"
    },
    "Mild Steel": {
        "0-2": "Coatings: For chemical resistance, use polyurethane or epoxy coatings. Restrictors: Phosphates or chromates can be used to create surface protective coatings. Cathodic Protection: In extremely acidic conditions, use sacrificial anodes (zinc, magnesium, etc.).",
        "2-4" : "Galvanization: Apply a zinc coating for sacrificial protection. Inhibitors: Use silicates or organic inhibitors in industrial processes or pipelines​ Coatings: Protective bituminous coatings are effective in mildly acidic environments",
        "4-6" : "Use phosphating or nitrite-based inhibitors for surface passivation. Apply epoxy or alkyd paints as barrier coatings to protect against oxygen and moisture.Anodic Protection: Utilizing anodic methods might also lessen corrosion",
        "7" : "Paints/Coatings: To protect the steel from moisture, apply epoxy or polymeric coatings. Cathodic Protection: To safeguard big structures (such as pipelines and bridges), impressed current systems or sacrificial anodes are frequently used.",
        "7-9" : "Passivation: Even in rather basic situations mild steel will form a naturally occurring oxide coating which will protect. Alkaline-Susceptible Paints: Where the product is somewhat alkaline silicates or other alkaline resistant paints or inhibitors; Cathodic protection; anodic protection or sacrificial anodes may be used.",
        "9-11" : "Protective Coatings: More protection is provided by polyurethane of epoxy coatings. Inhibitors: The oxide layer for the MDPI can be strengthened by chromates or molybdates. Passivation: Steel is typically passivated with high pH concrete surroundings providing long term protection.",
        "11-13" : "Corrosion Inhibitors: Calcium nitrite is used to inhibit corrosion due to chloride from occurring in concrete settings. Finishes: The coatings should be resistant to alkali in very alkaline settings.",
        ">13" : "Coatings: Apply epoxy, polyurethane, or zinc galvanizing as protection in order to form a barrier of protection. Inhibitors: Add sodium nitrite, sodium metasilicate, or phosphate based inhibitors into the surroundings to slow the corrosion. Cathodic Protection: Impressed current or sacrificial anod system is used to minimize oxidation. Alkaline-Resistant Alloys: You can, for better resistance, convert to low alloy steels containing elements such as chromium. Surface Passivation: We use passivating chemicals like sodium silicate to increase the steel's naturally occurring oxide shell.",
        "link_0-2": "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_2-4" : "https://www.mdpi.com/2075-4701/14/8/862",
        "link_4-6" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_7" : "https://www.mdpi.com/2075-4701/14/8/862",
        "link_7-9" : "https://www.mdpi.com/2075-4701/14/8/862",
        "link_9-11" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_11-13" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_>13" : "https://iopscience.iop.org/article/10.1088/1757-899X/1057/1/012012/pdf"
    },
    "Alloy Steel": {
        "0-2": "Coatings: To protect against exposure to acid, steel should be coated with high performance coatings, e.g. epoxy or fluoropolymer. Compounding Factors: Low alloy steels with molybdenum or chromium show superior corrosion resistance to the same in the acidic media; some organic inhibitors such as benzotriazole can be employed to create a barrier on the metal surface.",
        "2-4" : "Galvanization: Zinc coatings provide sacrificial protection. In somewhat acidic conditions low alloy steels with chromium content are recommended because of their ability to withstand localized corrosion. Limiters: Chromates or zinc phosphate are used to prevent corrosion especially in industrial institutions.",
        "4-6" : "Cathodic Protection: Low alloy steel is protected in slightly acidic situations by impressed current systems and sacrificial anodes, such as magnesium or zinc. Passivation: Chromium and nickel, contained in low alloy steels, form oxide layers of protection which resist corrosion.",
        "7" : "Surface Treatments: Low alloy steels that have been manganese- or molybdenum infused resist corrosion better. Epoxy paints have extra layers of protection. Structural steels, where immersion occurs in neutral pH conditions, are commonly and frequently hot dip galvanised.",
        "7-9" : "By using protective coatings made of polyurethane or alkyd, a long lasting protection is guaranteed. Inhibitors: Silicates and molybdates can also be added to water treatment to further lower the danger of corrosion.",
        "9-11" : "Alloying Elements: Chromium-containing low alloy steels provide superior defense against pitting caused by chlorides. When looking for corrosion inhibitors, consider using sodium silicate or sodium molybdate.It's",
        "11-13" : "Concrete conditions: In these types of conditions, the steel is passivated by the high pH. In very alkaline environments, molybdenum or vanadium low alloy steels are satisfactory. Restrictors: Other steels can be further protected against damage from chloride by applying calcium nitrite or calcium nitrate.",
        ">13" : "Alloying: Using molybdenum and chromium increases resistance to high pH. Inhibitors: Phosphate- and silicate-based inhibitors work well. Polyurethane coatings provide robust defense.",
        "link_0-2": "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_2-4" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_4-6" : "https://www.mdpi.com/2075-4701/14/8/862",
        "link_7" : "https://www.mdpi.com/2075-4701/14/8/862",
        "link_7-9" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_9-11" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_11-13" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_>13" : "https://www.sciencedirect.com/science/article/abs/pii/S0010938X22002888"
    },
    "Stainless Steel": {
        "0-2": "These extremely harsh, acidic environments can be apermitted by using stainless steels that are more highly alloyed containing greater concentrations of chromium, nickel and molybdenum 316L or 904L. Passivation: To make a proper protective layer on the steel surface, acid resistant passivation is carried out with the help of nitric acid or citric acid passivation. Coatings: Fluoropolymer or PTFE (Teflon) coatings protect steel from corrosive acids.",
        "2-4" : "Molybdenum-Enhanced Steels: Stainless steel grades containing higher levels of molybdenum to provide more pitting and crevice corrosion resistance are used—such as grade 316L. Inhibitors: Silicates or chromate inhibitors can be used to reduce corrosion rate in industrial systems.",
        "4-6" : "Passivation: If proper passivation treatments (with acid others and nitric) are followed, a persistent protective oxide layer can be guaranteed. Protective Coatings: Epoxy coatings should be applied where such exposure is probable. However, even resistant corrosion, stainless steel is still good for barrier coatings.",
        "7" : "Surface Finishes: Smooth surface finishes (such as electro-polishing) help you to reduce the chance of corrosion start. Cathodic protection is seldom used but can be used on big structures especially in coastal areas or marine areas where the chloride exposure is possible.",
        "7-9" : "Alkaline Cleaning and Passivation: This amounts to periodic cleaning with moderate alkaline solutions and passivation (ref. 1). Choice of Alloy: In these situations 304 or 316 may be used and 2205 duplex is preferred in harsher environments.",
        "9-11" : "Nickel-Based Alloys: In very alkaline conditions it may be necessary to use stainless steels with more nickel (such as 316L or Alloy 20) or even nickel based alloys. Restrictors: Preventing localized corrosion of molybdates or silicates in alkaline water system.",
        "11-13" : "Stress Relief: Stress relief annealing is used in very alkaline conditions to lower the stress corrosion cracking vulnerability. Protective Coatings: In harsh high pH conditions use linings or coatings which are resistant to alkali to prevent scaling and other forms of damage to equipment.",
        ">13" : "Passivation: Regular passivation prevents the formation of a new protective oxide layer. Coatings: It’s covered with Teflon or epoxy coatings for extra protection. Alloying: For more resistance use higher grades such as 316 with molybdenum.",
        "link_0-2": "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_2-4" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_4-6" : "https://www.mdpi.com/2075-4701/14/8/862",
        "link_7" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_7-9" : "https://www.mdpi.com/2075-4701/14/8/862",
        "link_9-11" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_11-13" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_>13" : "https://www.sciencedirect.com/science/article/abs/pii/S0010938X24000660"
    },
    "Tool Steel": {
        "0-2": "Coatings: To defend against very corrosive acids, apply ceramic coatings, or PTFE (commonly known as Teflon). Grades that Resist Corrosion: High alloy tool steels such as D2 (12 percent chromium) or H13 (With five additional chromium and furan) provide better resistance.",
        "2-4" : "Choose an alloy carefully. A2 tool steel (a mix of chromium) resists corrosion a little better in mildly acidic settings. Coatings: Zinc phosphating or a nickel plating are used to protect the steel. Inhibitors: Inhibition can occur through either organic or phosphate based, as a barrier form against corrosion.",
        "4-6" : "Passivation: To improve the chromium oxide layer on high-alloy tool steels, use nitric acid or chromic acid passivation. Protective Coatings: Tool steels can be coated with powder coatings or epoxy-based coatings to stop corrosion. Surface Treatments: Plasma nitriding makes the surface harder and more corrosion- and wear-resistant.It's",
        "7" : "Surface Finishes: Laying on bluing or polishing the tool steel can work to layer a protective oxide once formed. Galvanization or plating: If corrosion resistance is sought, the surface is nickel or chrome plated.",
        "7-9" : "Passivation: Keeping the protective layer, recommends routine alkaline cleaning and passivation. Corrosion-Resistant Steels: For slightly basic conditions, the grades of tool steel containing chromium and other alloying elements such as O1 and S7 provide higher resistance, and that’s it.",
        "9-11" : "Inhibitors: Additional defense can be provided in industrial water system silicates or molybdates. Surface Treatments: All rights reserved. In somewhat alkaline environments, hard chrome plating increases wear and corrosion resistance.",
        "11-13" : "Stress Relief: In severe environments lower stress corrosion cracking is likely with internal stress relief induced by heat treatment. Coatings: Additional protection can be provided in the case of very high exposure to high pH solutions with the use of PVD (Physical Vapor Deposition) or ceramic coatings.",
        ">13" : "Coatings: Coatings made out of ceramic or polymers. Inhibitors: Phosphate or sodium molybdate inhibitors may be useful under conditions of high pH. Cathodic protection: especially where used with tool steel when immersed.",
        "link_0-2": "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_2-4" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_4-6" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_7" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_7-9" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_9-11" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_11-13" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_>13" : "https://www.sciencedirect.com/journal/surface-and-coatings-technology/vol/385/suppl/C"
    },
    "Spring Steel": {
        "0-2": "Use stainless spring steels with a greater chromium and nickel content, such as 17-7 PH or AISI 302, as these grades are more corrosion-resistant.Coatings: So, protect the steel from exposure to the acid by taping it with ceramic, PTFE or epoxy. Surface Treatments: Electropolishing and passivation treatments can enhance the oxide layer on high alloy spring steel.",
        "2-4" : "Zinc phosphate coatings protect steel as a stand in for protection. In acidic situations, recommendation to use the AISI 301 or 17-7 PH stainless steel as they have superior corrosion resistance. Restrictors: For spring steel in contact with acids in industrial situations, use silicates or phosphates.",
        "4-6" : "Protective Coatings: Durable defense can be supplied by polyurethane or epoxy coatings. The hot dip galvanization is used as protective coating spring steel in corrosive or outdoor conditions. Frequent Upkeep: It is important to keep up with regular spring components cleaning and maintenance to get rid of stored moisture or acidic amounts accumulated.",
        "7" : "Protective Finishes: In neutral environments, oil coats or a phosphate treatment will stop corrosion. Cathodic Protection: The steel in enormous construction or submerged situation may be preserved through sacrificial anodes or impressed current systems.",
        "7-9" : "Spring steels containing chromium and vanadium (such as SAE 5160) can give them a better resistance. Inhibitors: Use molybdates and silicates to stop corrosion on somewhat basic settings.",
        "9-11" : "Coatings: Polyurethane based coatings are resistant to wear and corrosion in alkaline environments. Restrictors: In water systems, these inhibitors should be based on silicate or phosphate to stop any localized corrosion.",
        "11-13" : "Therapies for Stress Reduction: Less stress means fewer chances for steel that has been heat treated or annealed to break internally. High-Alloy Grades: Severe: handle select 17-7 PH stainless steel, or other grades with high nickel or chromium content.",
        ">13" : "Coatings made of polyurethane and epoxy are used to construct barriers. Zinc or aluminum are anodes to use for cathodic protection. Surface treatments: In non load bearing applications, anodizing may be useful.",
        "link_0-2": "https://www.mdpi.com/2075-4701/14/8/862",
        "link_2-4" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_4-6" : "https://www.mdpi.com/2075-4701/14/8/862",
        "link_7" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_7-9" : "https://www.mdpi.com/2075-4701/14/8/862",
        "link_9-11" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_11-13" : "https://www.mdpi.com/2075-4701/14/8/862",
        "link_>13" : "https://www.mdpi.com/2076-3417/11/18/8668"
    },
    "Iron": {
        "0-2": "Coatings made of polyurethane and epoxy are used to construct barriers. Zinc or aluminum are anodes to use for cathodic protection. Surface treatments: In non load bearing applications, anodizing may be useful.",
        "2-4" : "Coatings: Iron may be electrodeposited with nickel, or plated with zinc phosphate for further protection. Corrosion-Resistant Alloys: Where the carbon in the steel is high manganese or chromium, high, that is somewhat acidic, will give it better corrosion resistance than normally there would be. Inhibitors: Add inhibitors based on silicate in to acidic water systems to retard the corrosion process.",
        "4-6" : "Coatings: Also, iron can be further protected by applying either nickel plating or zinc phosphate. Alloys that Resist Corrosion: High carbon steel that is manganese or chromium had fortified can resist corrosion in slightly acidic conditions. Inhibitors: When used as inhibitors for use in acid water systems, use inhibitors based on silica.",
        "7" : "Coatings: It might be further protected by plating iron with nickel or zinc phosphate. Corrosion-Resistant Alloys: High carbon steel with added manganese or chromium is protected somewhat better in somewhat acidic situations. Inhibitors: In acidic water systems, to slow corrosion process, add inhibitors on silicate chemistry basis.",
        "7-9" : "Coatings: A layer of protection is provided through the coating zinc or epoxy based. Hot-dip galvanization: Iron is shielded from an acid environment with this process. Passivation: A thin layer of protective oxide can be formed by the application of nitric or chromic acid to the surface.",
        "9-11" : "Oil coats: Mineral oil or wax coats are used to stop corrosion. Inhibitors of Rust: Protective wax coats or rust-inhibiting primers are used for iron surfaces that are damp.",
        "11-13" : "Passivation: Passivation methods can therefore increase the naturally present oxide layer, especially in water or in soil conditions. Surface Treatment: Are liable to flake or corrode in extreme alkaline conditions, such as galvanization, or nickel plating is necessary.",
        ">13" : "Epoxy or polyurethane coatings: They then act as an impermeable shield from alkaline chemicals which can lead to corrosion. By sacrificing to the corrosive grip that zinc makes on corrosion, hot dip galvanization offers sacrificial protection with the zinc coating corroding before the underlying iron. Inhibitors: Sodium nitrite or sodium silicate inhibitors protectively coat the iron surface, and provide fairly effective corrosion control in extremely alkaline situations. Inhibitors based on phosphates: These will slow corrosion and help to make the iron surface passivated.",
        "link_0-2": "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_2-4" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_4-6" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_7" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_7-9" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_9-11" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_11-13" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_>13" : "https://pubs.rsc.org/en/content/articlehtml/2019/ra/c9ra08482g"
    },
    "Aluminium": {
        "0-2": "Corrosion prevention: Anodizing, PTFE (Teflon) or epoxy coatings can be used as a barrier of defense. Chromate is a very good inhibitor for aggressive corrosion occurring in very acidic situations.",
        "2-4" : "Corrosion Prevention: Aluminum becomes more resilient by nickel plating, chromic acid anodizing and zinc phosphate coating. Other inhibitors which are silicate and phosphate inhibitors can also be used.",
        "4-6" : "Strengthen the oxide layer with sulfuric acid anodizing and epoxy resins and polyurethane coatings, to prevent corrosion. Another use of chromites is to passivate aluminum, to protect it further.",
        "7" : "Corrosion Prevention: Further protection is provided under neutral pH conditions in environments containing chloride ions (such as saltwater) by silicone based coatings or polymer coatings.",
        "7-9" : "Corrosion Prevention: In somewhat basic settings, inhibitors such calcium-based inhibitors and sodium nitrite can lower the corrosion rate. Anodizing or alkaline washing also helps.",
        "9-11" : "Corrosion Prevention: Curtailing expensive spacecraft parts in favor of durable defense will remain useful with epoxy and anodizing coatings. In order to further decrease corrosion, molybdate inhibitors may be used.",
        "11-13" : "Corrosion Prevention: Aluminum does quite well in high pH environments, but anodizing or sodium metasilicate inhibitors can further help protect.",
        ">13" : "Anodizing: Corrosion resistance improves and fortifies the natural oxide layer. Coatings: More defense comes in the form of epoxy and polyurethane coatings. Inhibitors :Sodium silicate inhibitors are used to stop corrosion.",
        "link_0-2": "https://www.sciencedirect.com/science/article/abs/pii/B9780323904100000143",
        "link_2-4" : "https://www.sciencedirect.com/topics/physics-and-astronomy/anodizing",
        "link_4-6" : "https://www.sciencedirect.com/topics/materials-science/aluminum-coating",
        "link_7" : "https://www.researchgate.net/publication/371407814_Research_on_the_Influence_of_Coating_Technologies_on_Adhesion_Anti-Corrosion_Layers_in_the_Case_of_Al7175_Aluminum_Alloy",
        "link_7-9" : "https://www.sciencedirect.com/science/article/pii/S2666086521002010#:~:text=Alkaline%20solutions%20especially%20sodium%20and,inhibitors%20for%20most%20aluminum%20alloys.",
        "link_9-11" : "https://www.sciencedirect.com/science/article/abs/pii/S001346861732577X",
        "link_11-13" : "https://www.sciencedirect.com/topics/engineering/aluminum-corrosion#:~:text=Aluminum%20corrosion%20resistance%20is%20also,below%204%20or%20above%207.",
        "link_>13" : "https://www.sciencedirect.com/topics/engineering/aluminum-corrosion#:~:text=Aluminum%20corrosion%20resistance%20is%20also,below%204%20or%20above%207."
    },
    "Copper": {
        "0-2": "Corrosion Prevention: That copper corrodes quickly in extremely acidic circumstances. Teflon or epoxy coatings, polymer based coatings. Chromate based inhibitors can effectively lower the rate of corrosion.",
        "2-4" : "Corrosion prevention: These work well: zinc phosphate and nickel plating. Silicate based inhibitors can also control pit formation and surface deterioration.",
        "4-6" : "Corrosion can be prevented by epoxy or polyurethane coatings. The natural oxide coating of copper can be strengthened further, for additional protection, through sulfuric acid anodizing.",
        "7" : "Corrosion Prevention: Protective coatings like silicone based coatings or polymer coatings make the copper durable in neutral conditions, however such coatings are effective to avoid chloride induced corrosion.",
        "7-9" : "Preventing corrosion: Enough defense is provided by epoxy and anodizing coatings. Incorporation of sodium molybdate as an inhibitor can help reduce corrosion in situations that are somewhat alkaline.",
        "9-11" : "Preventing Corrosion: Copper functions best in conditions that are somewhat alkaline. Coatings that are resistant to alkali, such epoxy or polyurethane, can improve durability. Inhibitors of sodium metasilicate are efficient.",
        "11-13" : "Corrosion Prevention: protection can be achieved through passivation techniques and molybdate based inhibitors, even in the presence of high pH levels that are favorable to copper stability.",
        ">13" : "The anodizing enhances natural protective coating of copper. Coatings: Hot acid, if possible, should be further protected with epoxy or coatings resistant to alkalis. Inhibitors: The rate of corrosion is lowered using inhibitors based on borate or sodium molybdate.",
        "link_0-2": "https://www.sciencedirect.com/science/article/abs/pii/S0010938X20301980",
        "link_2-4" : "https://www.sciencedirect.com/science/article/abs/pii/S0010938X09006143",
        "link_4-6" : "https://www.sciencedirect.com/journal/surface-and-coatings-technology/vol/484/suppl/C",
        "link_7" : "https://www.sciencedirect.com/science/article/abs/pii/S026130690800527X",
        "link_7-9" : "https://www.sciencedirect.com/science/article/abs/pii/S0167732223017919#:~:text=BI%20and%20its%20two%20derivatives,structure%20of%20the%20corrosion%20inhibitors.",
        "link_9-11" : "https://www.sciencedirect.com/science/article/abs/pii/S0013468606000387",
        "link_11-13" : "https://www.sciencedirect.com/science/article/abs/pii/S0010938X08000486",
        "link_>13" : "https://www.sciencedirect.com/science/article/abs/pii/S0013468606000387"
    }
}
