{
    "Carbon Steel": {
        "0-2": "Organic and phosphate corrosion inhibitors are used in highly acid environments. Organic molecules in solution block active sites on the metal surface and form an impermeable barrier from deposited phosphate coatings. In cases involving sulfuric or hydrochloric acid, polymer coatings or linings such as epoxy can be highly effective.",
        "2-4": "In combination with corrosion inhibitors like zinc phosphate or chromates, corrosion is mitigated with galvanizing, or coating with zinc. Cathodic protection is commonly used to protect against oxidation.",
        "4-6": "Organic coatings, in combination with chemicals, such as phosphating or protective films, on bitumen-based coatings have proven effective for surface passivation. Low-carbon steels can also be used in such applications since they are less susceptible to acid corrosion.",
        "7": "Carbon steel corrodes slowly in neutral conditions. It is normally protected by barrier coatings, anodic protection techniques, or protective paints. Furthermore, surface texturing can improve corrosion resistance as it also decreases the area exposed to corrosive substances.",
        "7-9": "applying protective coatings like epoxy or polymeric coatings is essential, especially in harsh environments. In alkaline conditions, corrosion tends to slow down naturally. However, in certain marine environments, it is important to note that some corrosion inhibitors can weaken the effectiveness of sacrificial anodes made of materials like magnesium or zinc, which are commonly used to reduce corrosion.",
        "9-11": "Corrosion protection can be achieved through the use of alkaline resistant coatings and inhibitors such as silicates or polyphosphates. Inhibitors create stable complex surface that protect the surface from corrosion initiation. Using these coatings and inhibitors, one can provide long-lasting protection, even in cases when steel is left to be exposed to alkaline environment.",
        "11-13": "it is common to prevent corrosion by using organic inhibitors (such as alkanolamines), which adsorb at the steel-well water interface, forming a protective film on the low-carbon steel surface. These inhibitors function by blocking active sites on the metal, resulting in a lower rate of corrosion as they limit the exposure of the surface to the environment.",
        ">13" : "There are several effective strategies to prevent carbon steel from corroding in high pH environments. Molybdate and phosphates are one of the inhibitors used for acid corrosion process, which is the formation of protective coatings at strong alkaline solutions, which will definitely slow down the corrosion process in those respective solutions. Applying a surface treatment like a zinc-rich primer or epoxy/polyurethane coatings creates a physical barrier to protect the steel. ",
        "link_0-2": "https://www.mdpi.com/2075-4701/14/8/862",
        "link_2-4" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_4-6" : "https://www.mdpi.com/2075-4701/14/8/862",
        "link_7" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_7-9" : "https://www.mdpi.com/2075-4701/14/8/862",
        "link_9-11" : "https://www.mdpi.com/2075-4701/14/8/862",
        "link_11-13" : "https://link.springer.com/article/10.1007/s40735-023-00791-4",
        "link_>13" : "https://meridian.allenpress.com/corrosion/article/75/1/106/199221/Long-Term-Evolution-of-Corrosion-Potential-of"
    },
    "Mild Steel": {
        "0-2": "Polyurethane or epoxy coating prevents corrosion. Phosphates or chromates can also be used as restrictors in order to make surface protecting layers to give some additional protection. Servicing of steel components presents can be the use of sacrificial anodes, such as zinc or magnesium, to protect steel by establishing an alternative cathodic pathway to raise a protective barrier in highly acidic environments.",
        "2-4": "Applying a zinc coating (Galvanization) to provide sacrificial protection for steel is effective method for corrosion prevention. In the mildly acid environment, protective bituminous coatings give reliable cover, thus enhancing its resistance against corrosion in steel. The inhibitors used would be silicates or organic substances such as Amines, Fatty acids, Benzotriazole, Imidazolines.",
        "4-6": "Use of phosphating or nitrite-based inhibitors is suggested for surface passivation. Epoxy or alkyd paints can be used as barrier coatings to protect against oxygen and moisture. Additionally, anodic protection methods can be used to further reduce corrosion, providing an extra layer of protection.  ",
        "7": "Epoxy or polymeric coatings are one of the most effective ways to protect steel from moisture. It is primarily used via impressed current systems or sacrificial anodes as it is most commonly employed for assets of larger scale, such as pipelines and bridges.",
        "7-9": "Mild steel is protected by an oxide layer in basic conditions, passivation is a natural protection of mild steel. In a slightly alkaline environment, silicate-based or alkaline-resistant paints and inhibitors are recommended. ",
        "9-11": "There are general protective coatings such as polyurethane or epoxy against corrosion. Where there is a high pH concrete environment, passivating the steel is long term.",
        "11-13": "Calcium Nitrite is commonly used as an effective corrosion inhibitor to prevent corrosion caused by Chloride in concrete environment. ",
        ">13" : "strong protection can be obtained by using strong coatings (like epoxy or polyurethane or zinc galvanizing). Inhibitors, especially sodium nitrite, sodium metasilicate or phosphate-based compounds, when introduced to the environment, can impede the corrosion rate. Cathodic protection (such as the use of an impressed current or sacrificial anode system) can be employed to reduce oxidation. It would be best to switch to alloys that are resistant to alkaline conditions, such as low alloy steels that also have chromium as an alloying element. This strengthens and protects the naturally occurring surface oxide layer on the steel, using chemicals like sodium silicate for long term surface passivation. ",
        "link_0-2": "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_2-4" : "https://www.mdpi.com/2075-4701/14/8/862",
        "link_4-6" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_7" : "https://www.mdpi.com/2075-4701/14/8/862",
        "link_7-9" : "https://www.mdpi.com/2075-4701/14/8/862",
        "link_9-11" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_11-13" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_>13" : "https://iopscience.iop.org/article/10.1088/1757-899X/1057/1/012012/pdf"
    },
    "Alloy Steel": {
        "0-2": "Applying high-performance coatings like epoxy or fluoropolymer will provide a strong protective barrier. For enhanced corrosion resistance in acidic media, low alloy steels containing molybdenum or chromium offer superior durability. Some organic inhibitors such as benzotriazole can be employed to create a barrier on the metal surface.",
        "2-4": "Galvanization (Zinc coatings) gives sacrificial protection, which helps prevent corrosion by allowing the zinc to corrode, rather than the steel. In moderate acidic conditions low alloy steels with chromium content are suggested to withstand localized corrosion. Chromates or Zinc phosphate are commonly applied to inhibit corrosion in particular of industrial institutions.",
        "4-6": "In slightly acidic environments, low alloy steel can be effectively protected, such as: through cathodic protection using impressed current systems or sacrificial anodes like Magnesium or Zinc. Low alloy steels have an increased chromium content that promotes passivation, preventing corrosion by forming a protective oxide layer.",
        "7": "Surface treatments such as infusing low alloy steels with Manganese significantly improve their corrosion resistance. Molybdenum impregnation of low alloy steels, yielding very good resistance to corrosion. Applying epoxy paints is the final extra layer of protection. Structural steels are hot dip galvanised commonly and frequently because immersion takes place under neutral pH conditions.",
        "7-9": "protective coatings made of polyurethane or alkyd is a guaranteed solution for long-lasting protection. Corrosion can also be decreased by the addition of inhibitors, such as silicates and molybdates, to the treatment processes of water.",
        "9-11": "Chromium bearing low alloy steels are effective against chloride pitting corrosion. Other corrosion inhibitors such as Sodium Silicate or Sodium Molybdate can also be employed.",
        "11-13": "At high pH, as found in concrete and cement, steel is passivated and a protective barrier forms. Molybdenum or vanadium low alloy steels exhibit decent corrosion resistance in highly alkaline environments. Use of restrictors such as Calcium Nitrite, or Calcium Nitrate, is found to be an effective strategy to avoid chlorideinduced damage in steel.",
        ">13" : "Adding molybdenum and chromium into alloys improves their resistance to high pH conditions. Phosphate and silicate-based inhibitors are efficient for slowing down the corrosion process. Applying polyurethane coatings also provides strong, long-lasting protection.",
        "link_0-2": "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_2-4" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_4-6" : "https://www.mdpi.com/2075-4701/14/8/862",
        "link_7" : "https://www.mdpi.com/2075-4701/14/8/862",
        "link_7-9" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_9-11" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_11-13" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_>13" : "https://www.sciencedirect.com/science/article/abs/pii/S0010938X22002888"
    },
    "Stainless Steel": {
        "0-2": "For more aggressive acidic environments, highly alloyed forms are used including 316L or 904L in which higher levels of chromium, nickel, and molybdenum are contained. This is further enhanced due to the application of acid-resistant passivation such as nitric or citric acid, which prevents corrosion and creates a robust layer on the steel surface. Fluoropolymer or PTFE (Teflon) coating safeguards steel from corrosives or acids.",
        "2-4": "Stainless steels with higher molybdenum content, like 316L, demonstrate greater resistance to pitting and crevice corrosion. In industrial systems silicates or chromate inhibitors are used to decrease the corrosion rate significantly.",
        "4-6": "Proper passivation treatments involving nitric acid ensures the formation of a durable protective oxide layer on the steel, providing long-lasting corrosion resistance. Applying epoxy coatings is highly recommended in environments where corrosive elements are likely to be present. ",
        "7": "Using smooth surface finishes, such as electro-polishing, effectively reduces the possibility of corrosion. Cathodic protection can be an effective solution for large structures, especially in coastal or marine environments where exposure to chlorides is common.",
        "7-9": "Alkaline cleaning followed by passivation, which involves periodic washing with mild alkaline solutions, is an effective way for corrosion prevention. 304 or 316 stainless steels are commonly used in mild alkaline environment due to their good corrosion resistance.",
        "9-11": "Using stainless steels with higher nickel content, such as 316L, Alloy 20 or even nickel-based alloys can provide effective corrosion resistance. Restrictors like molybdates or silicates can be applied to prevent localized corrosion in alkaline water systems, helping to inhibit corrosion and protect the metal surfaces.",
        "11-13": "Stress relief annealing is applied in highly alkaline environments to reduce the stress corrosion cracking susceptibility. Applying linings or coatings resistant to alkali like PTFE (Polytetrafluoroethylene) linings, Rubber linings, Epoxy coatings, Ceramic coatings etc are recommended in severe high pH environments.",
        ">13" : "For stainless steel, under highly alkaline conditions (pH > 13), the presence of a protective oxide layer will be maintained through regular passivation. Teflon or epoxy coatings provide an extra barrier against corrosive environments. Using higher-grade alloy like 316 stainless steel, which contains molybdenum, is recommended as it provides superior corrosion resistance.",
        "link_0-2": "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_2-4" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_4-6" : "https://www.mdpi.com/2075-4701/14/8/862",
        "link_7" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_7-9" : "https://www.mdpi.com/2075-4701/14/8/862",
        "link_9-11" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_11-13" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_>13" : "https://www.sciencedirect.com/science/article/abs/pii/S0010938X24000660"
    },
    "Tool Steel": {
        "0-2": "Ceramic coatings or PTFE (often known as Teflon) provide effective protection against highly corrosive acids. High alloy tool steels, such as D2 (12% chromium) and H13 (with additional chromium and vanadium), provide high corrosion resistance.",
        "2-4": "A2 tool steel, which contains chromium, provides better protection in mildly acidic environments. Coatings like zinc phosphating or nickel plating can be applied. Organic or phosphate-based inhibitors can be used which can help to slow down the corrosion. ",
        "4-6": "Nitric acid or Chromic acid passivation can be used to improve the Chromium oxide layer. Epoxy-based coating is highly effective for corrosion prevention of Tool steels. Plasma nitriding makes the surface harder and more corrosion resistant.",
        "7": "Surface finishes such as bluing or polishing help in the formation of a protective oxide coating on tool steel. Galvanization or plating with Nickel or Chromium provides effective protection.",
        "7-9": "Routine alkaline cleaning and passivation is required to maintain the protective oxide layer. For slightly basic conditions, the grades of tool steel containing chromium and other alloying elements such as O1 and S7 provide higher resistance.",
        "9-11": "Silicates or Molybdates can be used as inhibitors. Hard chrome plating is highly effective in mildly alkaline environments",
        "11-13": "Additional protection can be provided in the case of very high exposure to high pH solutions with the use of PVD (Physical Vapor Deposition) or ceramic coatings.",
        ">13" : "Ceramic or polymer coatings can be applied to steel surfaces For effective protection. Inhibitors like Phosphate or Sodium Molybdate may be useful under conditions of high pH. Cathodic protection is highly effective especially when tool steel is immersed in corrosive environments. ",
        "link_0-2": "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_2-4" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_4-6" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_7" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_7-9" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_9-11" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_11-13" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_>13" : "https://www.sciencedirect.com/journal/surface-and-coatings-technology/vol/385/suppl/C"
    },
    "Spring Steel": {
        "0-2": "Use of stainless spring steels with higher Chromium and Nickel content, such as 17-7 PH or AISI 302 will be effective. Coating it with materials like ceramic, PTFE, or epoxy will provide effective barrier. Electropolishing and passivation treatments can enhance the oxide layer on high alloy spring steel.",
        "2-4": "Use zinc phosphate coatings for a reliable protection for steel. It is highly recommended to use stainless steels such as AISI 301 or 17-7 PH due to their excellent corrosion resistance properties in acidic environments. In industrial applications, spring steel can contact acids, so silicate or phosphate-based restrictors are effective.",
        "4-6": "Polyurethane or epoxy coatings are good protective options. In outdoor or corrosive environments, hot-dip galvanization of spring steel provides long-term, reliable protection. Spring parts should be cleaned regularly to remove moisture or acidic deposits that may have accumulated to avoid long-term damage.",
        "7": "Oil coatings or phosphate treatments are effective on hindering corrosion. For large-scale constructs or submerged steel, cathodic safety techniques and systems such as sacrificial anodes or impressed current systems may be applied.",
        "7-9": "Spring steels containing Chromium and Vanadium (such as SAE 5160) can provide a better resistance. Use Molybdates and Silicates to stop corrosion in mild alkaline environment.",
        "9-11": "Polyurethane-based coatings provide effective protection corrosion in alkaline environments. Use of inhibitors like Silicates or Phosphates is effective in preventing localized corrosion.",
        "11-13": "High-alloy grades like 17-7 PH stainless steel or alloys with high Nickel or Chromium content provide superior resistance to corrosion. ",
        ">13" : "Polyurethane and epoxy coatings are highly effective for protective barriers. Zinc or Aluminium anodes are commonly used to prevent corrosion by cathodic protection. ",
        "link_0-2": "https://www.mdpi.com/2075-4701/14/8/862",
        "link_2-4" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_4-6" : "https://www.mdpi.com/2075-4701/14/8/862",
        "link_7" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_7-9" : "https://www.mdpi.com/2075-4701/14/8/862",
        "link_9-11" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_11-13" : "https://www.mdpi.com/2075-4701/14/8/862",
        "link_>13" : "https://www.mdpi.com/2076-3417/11/18/8668"
    },
    "Iron": {
        "0-2": "Coatings made of polyurethane and epoxy are used to construct barriers. Zinc or aluminium are anodes to use for cathodic protection. Anodizing can be effective in non-load bearing applications.",
        "2-4": "Iron can be electrodeposited with Nickel or plated with Zinc phosphate to create corrosion-resistant coating. You can add inhibitors based on silicate in to acidic water systems to retard the corrosion process.",
        "4-6": "Iron can be protected by applying Nickel plating or Zinc phosphate. High-carbon steel, reinforced with Manganese or Chromium, shows improved resistance to corrosion, particularly in mildly acidic environments. Silica-based inhibitors are effective in reducing the corrosion rate for acid water systems.",
        "7": "Iron can be protected by applying Nickel plating or Zinc phosphate. You can add inhibitors based on silicate in to acidic water systems to retard the corrosion process.",
        "7-9": "Coatings such as Zinc or epoxy creates a protective barrier on the steel. Hot-dip galvanization provides protection through Zinc coating. A thin layer of protective oxide can be formed by the application of nitric or chromic acid to the surface.",
        "9-11": "For iron under slightly alkaline conditions, coatings such as mineral oil or wax, can easily protect the metal by forming impermeable coatings to protect it from moisture and corrosive agents. Alkali-resistant coatings are more suitable than rust-inhibiting primers for these environments. ",
        "11-13": "Passivation methods help to enhance the natural oxide layer on metals particularly in water or soil environments. Galvanization or Nickel plating can be effective in extreme alkaline conditions.",
        ">13" : "Epoxy or polyurethane coatings act as an impermeable shield from alkaline chemicals which can lead to corrosion. Hot-dip galvanization provides sacrificial protection. Inhibitors like Sodium nitrite or Sodium silicate create a protective layer on the iron surface. Phosphate-based inhibitors will slow down corrosion and help to make the iron surface passivated.",
        "link_0-2": "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_2-4" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_4-6" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_7" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_7-9" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_9-11" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_11-13" : "https://pubs.rsc.org/en/content/articlehtml/2017/ra/c6ra25094g",
        "link_>13" : "https://pubs.rsc.org/en/content/articlehtml/2019/ra/c9ra08482g"
    },
    "Aluminium": {
        "0-2": "Anodizing, PTFE (Teflon), or epoxy coatings can be applied as effective barriers. Chromate is a very good inhibitor for aggressive corrosion occurring in very acidic situations.",
        "2-4": "Nickel plating, Chromic acid anodizing, and Zinc phosphate coating can be used to protect from corrosion. Silicate and Phosphate-based inhibitors can be used to prevent corrosion. ",
        "4-6": "Sulfuric acid anodizing can be used to strengthen Aluminium's oxide layer. Applying epoxy resins or Polyurethane coatings creates a protective barrier. Chromite can be used to passivate aluminium.",
        "7": "Silicone-based coatings or polymer coatings provides corrosion protection especially in environments with chloride ions like saltwater.",
        "7-9": "Using corrosion inhibitors like Calcium-based inhibitors and Sodium nitrite can significantly reduce the corrosion rate. Additionally, anodizing and alkaline washing are effective treatments. ",
        "9-11": "Applying durable coatings like epoxy and anodizing is highly effective to prevent corrosion especially in spacecraft parts. Molybdate inhibitors can be used To enhance corrosion resistance.",
        "11-13": "Aluminium naturally performs well in high pH environments due to the formation of a protective oxide layer. The oxide layer can be made thicker even more by anodizing. Inhibitors (e.g. sodium metasilicate) can be used to provide additional protection by slowing down the corrosion reaction.",
        ">13" : "Improving aluminium corrosion resistance with anodizing by increasing natural oxide layer thickness Epoxy and Polyurethane coatings resist exposure to the environment. Corrosion can also be reduced through the addition of sodium silicate inhibitors. ",
        "link_0-2": "https://www.sciencedirect.com/science/article/abs/pii/B9780323904100000143",
        "link_2-4" : "https://www.sciencedirect.com/topics/physics-and-astronomy/anodizing",
        "link_4-6" : "https://www.sciencedirect.com/topics/materials-science/aluminum-coating",
        "link_7" : "https://www.researchgate.net/publication/371407814_Research_on_the_Influence_of_Coating_Technologies_on_Adhesion_Anti-Corrosion_Layers_in_the_Case_of_Al7175_Aluminum_Alloy",
        "link_7-9" : "https://www.sciencedirect.com/science/article/pii/S2666086521002010#:~:text=Alkaline%20solutions%20especially%20sodium%20and,inhibitors%20for%20most%20aluminum%20alloys.",
        "link_9-11" : "https://www.sciencedirect.com/science/article/abs/pii/S001346861732577X",
        "link_11-13" : "https://www.sciencedirect.com/topics/engineering/aluminum-corrosion#:~:text=Aluminum%20corrosion%20resistance%20is%20also,below%204%20or%20above%207.",
        "link_>13" : "https://www.sciencedirect.com/topics/engineering/aluminum-corrosion#:~:text=Aluminum%20corrosion%20resistance%20is%20also,below%204%20or%20above%207."
    },
    "Copper": {
        "0-2": "Protective barriers can be formed with Teflon, epoxy coatings, or polymer-based coatings. To mitigate corrosion rate, chromate-based inhibitors can be employed.",
        "2-4": "Corrosion is prevented by zinc phosphating and Nickel plating. For pit formation and surface deterioration control silicate-based inhibitors can find application.",
        "4-6": "The use of Epoxy or Polyurethane coatings can effectively prevent corrosion. The process of sulfuric acid anodizing actually does help strengthen the natural oxide layer of copper.",
        "7": "Silicone based coatings or polymer coatings are the protective coatings, which, in neutral conditions, give durability to the Copper. Chloride-induced corrosion can be prevented with such coatings. ",
        "7-9": "Epoxy and anodizing coatings form a barrier to corrosion. Corrosion is inhibited by Sodium Molybdate by preventing chemical reactions resulting in oxidation in alkaline media.",
        "9-11": "Copper works well in moderately alkaline conditions. Epoxy or Polyurethane coatings improves the corrosion resistance. Sodium metasilicate inhibitors are effective to prevent corrosion by reducing the chemical reactions that cause metal surfaces to degrade.",
        "11-13": "Passivation techniques and Molybdate based inhibitors provides corrosion protection in high pH environment. ",
        ">13" : "Anodizing enhances natural protective coating of Copper. Epoxy or other alkali-resistant coatings provides further protection. Inhibitors based on Borate or Sodium molybdate reduces the rate of corrosion. ",
        "link_0-2": "https://www.sciencedirect.com/science/article/abs/pii/S0010938X20301980",
        "link_2-4" : "https://www.sciencedirect.com/science/article/abs/pii/S0010938X09006143",
        "link_4-6" : "https://www.sciencedirect.com/journal/surface-and-coatings-technology/vol/484/suppl/C",
        "link_7" : "https://www.sciencedirect.com/science/article/abs/pii/S026130690800527X",
        "link_7-9" : "https://www.sciencedirect.com/science/article/abs/pii/S0167732223017919#:~:text=BI%20and%20its%20two%20derivatives,structure%20of%20the%20corrosion%20inhibitors.",
        "link_9-11" : "https://www.sciencedirect.com/science/article/abs/pii/S0013468606000387",
        "link_11-13" : "https://www.sciencedirect.com/science/article/abs/pii/S0010938X08000486",
        "link_>13" : "https://www.sciencedirect.com/science/article/abs/pii/S0013468606000387"
    }
}
